app/controllers/session_controller.rb

    def create
        user = User.find_by(login: params[:login])
---
SELECT  "users".* FROM "users" WHERE "users"."login" = $1 LIMIT $2  [["login", "bob1"], ["LIMIT", 1]]